#! format: off

const λ = 3 / 1.21 * 2 / 295
const ω0 = 1.000
const ω = 1.000
const γ = 1 / 295
const η = 0
const α = -1

fu(u, v) = (-4*γ*ω*u - 2*λ*v - 4*(1 - ω^2)*v - 3*α*v*(u^2 + v^2) - η*ω*u*(u^2 + v^2))/(8*ω)
fv(u, v) = (-4*γ*ω*v - 2*λ*u + 4*(1 - ω^2)*u + 3*α*u*(u^2 + v^2) - η*ω*v*(u^2 + v^2))/(8*ω)
dfvdv(u, v) = (-4*γ*ω + 6*α*u*v - η*ω*(u^2 + 3*v^2))/(8*ω)
dfudu(u, v) = (-4*γ*ω - 6*α*u*v - η*ω*(3*u^2 + v^2))/(8*ω)
dfvdu(u, v) = (- 2*λ + 4*(1 - ω^2) + 9*α*u^2 + 3*α*v^2 - 2*η*ω*u*v)/(8*ω)
dfudv(u, v) = (- 2*λ - 4*(1 - ω^2) - 3*α*u^2 - 9*α*v^2 - 2*η*ω*u*v)/(8*ω)

include("2d_hamiltonian.jl")
#! format: on
