function H(x, p)
    x1, x2 = eachrow(x)
    p1, p2 = eachrow(p)

    X = @. (x1^2 + x2^2)
    P = @. (p1^2 + p2^2)
    return @. 0.5*P + p2*(-((λ * x1) / (4 * ω)) + ((1 - ω^2) * x1) / (2 * ω) - (γ * x2) / 2 + (3 * α * x1 * X) / (8 * ω) - 1 / 8 * η * x2 * X) + p1*(-((γ * x1) / 2) - (λ * x2) / (4 * ω) - ((1 - ω^2) * x2) / (2 * ω) - 1 / 8 * η * x1 * X - (3 * α * x2 * X) / (8 * ω))
end
function H_x(x, p)
    x1, x2 = eachrow(x)
    p1, p2 = eachrow(p)

    H_x1 = @. (1 / (8 * ω)) * (-4 * γ * ω * p1 + p2 * (4 - 2 * λ - 4 * ω^2 + 9 * α * x1^2 - 2 * η * ω * x1 * x2 + 3 * α * x2^2) - p1 * (6 * α * x1 * x2 + η * ω * (3 * x1^2 + x2^2)))
    H_x2 = @. -(1 / (8 * ω)) * (p1 * (4 + 2 * λ - 4 * ω^2 + 3 * α * x1^2 + 2 * η * ω * x1 * x2 + 9 * α * x2^2) + p2 * (4 * γ * ω - 6 * α * x1 * x2 + η * ω * (x1^2 + 3 * x2^2)))
    Matrix([H_x1 H_x2]')
end

function H_p(x, p)
    x1, x2 = eachrow(x)
    p1, p2 = eachrow(p)

    H_p1 = @. p1 - 0.5 * γ * x1 - 0.125 * η * x1^3 + 0.5 * ω * x2 - 0.125 * η * x1 * x2^2 + (x2 * (-0.5 - 0.25 * λ - 0.375 * α * x1^2 - 0.375 * α * x2^2)) / ω
    H_p2 = @. p2 - 0.5 * ω * x1 - 0.5 * γ * x2 - 0.125 * η * x1^2 * x2 - 0.125 * η * x2^3 + (x1 * (0.5 - 0.25 * λ + 0.375 * α * x1^2 + 0.375 * α * x2^2)) / ω
    Matrix([H_p1 H_p2]')
end
